const CONFIG = {
    // הגדרות API
    api: {
        url: 'https://script.google.com/macros/s/AKfycbxtqj9BNbf1ZQzQkychAI3FqGjZXhniI8Kyp72HMgrPDqY25KcHXQ1Jk8VNC3je7rJqag/exec'
    },

    // הגדרות מבחן לא עובד מכאן
    quiz: {
        // isAvailable: false,  // האם המבחן זמין כרגע
        isAvailable: true,  // האם המבחן זמין כרגע
        nextQuizDate: '2025-05-19',  // תאריך המבחן הבא
        hebrewDate: "יום שני",  // תאריך עברי
        displayDate: "19.5",  // תאריך לתצוגה
        showAnnouncement: true,  // האם להציג הודעה לפני המבחן
        announcementText: "נערים יקרים לפניכם מבחן הכנה לשלב הגמר\n\nאתם עתידים לעשות מבחן נוסף ביום שני [מעמד שלב הגמר]\nמבחן בכתב, 3 נבחנים יזכו ב1,500 ₪ [המצטיינים ביותר, ועוד 10 נבחנים יזכו במלגה של 700 ₪, בכדי לזכות במבחן עליכם לעבור את המבחן ביום שני\n\nביום שני יתקיימו 2 מבחנים – מבחן אחד בכניסה לאולם [שעה 19:30]\nומבחן נוסף [מבחן בכתב] על הבמה [מבחן בהספק של 2 דק']\nלאחר בדיקת המבחנים יקבע סכום המלגות\n ביום המבחן תקבלו תעודה, ויום לאחר מכן יתקבלו התוצאות\nאתם תקבלו קישור לרישום פרטי הבנק של חשבון ההורים",
        // introductionText: "אומר המלווה [נותן ההלואה], ללווה סלע הלויתני עליו ושקל היה שווה, הלווה עונה סלע הלויתני עליו ו3 דינרים היה שווה במקרה הזה היה על הלווה [מקבל ההלואה] להישבע כיון שהודה במקצת מן הטענה, ומחדשת הגמרא שעל המלווה להשבע שמא אם ישבע הלוה - יש לחוש שמא יוציא המלווה את הפיקדון ויפסול את הלווה לעדות ולשבועה, כיון שנשבע שבועת שקר\n\nוהקושיה!!  שהרי רב הונא סובר שגם אם השומר משלם עליו להישבע שאינה ברשותו [וכאן בנידון שלנו המלווה הוא שומר על הפיקדון], והרי לפי רב הונא הוא נשבע שאינה ברשותו וממילא איך יש חשש שמא יוציא את הפקידון, הרי הוא נשבע שאינה ברשותו!!"
        introductionText: "" // הקדמה לשאלות (מוצג בראש השאלה הראשונה)
    },

    // הגדרות כלליות
    general: {
        projectName: 'מתיקות התורה',
        organizationName: 'אור ישראלי'
    }
};

// מניעת שינויים בקונפיגורציה
Object.freeze(CONFIG); 