const CONFIG = {
    // הגדרות API
    api: {
        url: 'https://script.google.com/macros/s/AKfycbxMTBghOkhhxWPNFNoQ6bLqwTyObdw46uqd7ReJDzpnBowcXfBW-VyF6ZzKbtKOIr451A/exec'
    },

    // הגדרות מבחן לא עובד מכאן
    quiz: {
        isAvailable: false,  // האם המבחן זמין כרגע
        // isAvailable: true,  // האם המבחן זמין כרגע
        nextQuizDate: '2025-05-19',  // תאריך המבחן הבא
        hebrewDate: "סגור זמנית",  // תאריך עברי
        displayDate: "19.5",  // תאריך לתצוגה
        showAnnouncement: false,  // האם להציג הודעה לפני המבחן
        announcementText: "המבחן השבועי זמין כעת! לחץ על כפתור 'התחל מבחן' כדי להתחיל.",
        // introductionText: "אומר המלווה [נותן ההלואה], ללווה סלע הלויתני עליו ושקל היה שווה, הלווה עונה סלע הלויתני עליו ו3 דינרים היה שווה במקרה הזה היה על הלווה [מקבל ההלואה] להישבע כיון שהודה במקצת מן הטענה, ומחדשת הגמרא שעל המלווה להשבע שמא אם ישבע הלוה - יש לחוש שמא יוציא המלווה את הפיקדון ויפסול את הלווה לעדות ולשבועה, כיון שנשבע שבועת שקר\n\nוהקושיה!!  שהרי רב הונא סובר שגם אם השומר משלם עליו להישבע שאינה ברשותו [וכאן בנידון שלנו המלווה הוא שומר על הפיקדון], והרי לפי רב הונא הוא נשבע שאינה ברשותו וממילא איך יש חשש שמא יוציא את הפקידון, הרי הוא נשבע שאינה ברשותו!!"
        introductionText: ""
    },

    // הגדרות כלליות
    general: {
        projectName: 'מתיקות התורה',
        organizationName: 'אור ישראלי'
    }
};

// מניעת שינויים בקונפיגורציה
Object.freeze(CONFIG); 